<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Message Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'internal_server_error' => 'সার্ভারে একটি ত্রুটি ঘটেছে। অনুগ্রহ করে পরে আবার চেষ্টা করুন',
    'otp_sent' => 'ভেরিফিকেশন কোড পাঠানো হয়েছে',
    'otp_resent' => 'ভেরিফিকেশন কোড পুনরায় পাঠানো হয়েছে',
    'otp_sending_blocked' => 'আপনার এই নম্বরটি ৫ মিনিটের জন্য ব্লক করা হয়েছে। অনুগ্রহ করে অপেক্ষা করুন',
    'user_inactive' => 'আপনার অ্যাকাউন্ট নিষ্ক্রিয় করা হয়েছে। অনুগ্রহ করে অ্যাডমিনিস্ট্রেটরের সাথে যোগাযোগ করুন',
    'user_deleted' => 'আপনার তথ্য মুছে ফেলা হয়েছে',


    /*
    |--------------------------------------------------------------------------
    | Custom Message Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom messages.
    |
    */

    'custom' => [
        'configuration' => [
            'update' => [
                'basicInfo' => [
                    'success' => 'প্রতিষ্ঠানের মৌলিক তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'প্রতিষ্ঠানের মৌলিক তথ্য আপডেট করা যায় নি'
                ],
                'additionalInfo' => [
                    'success' => 'প্রতিষ্ঠানের অতিরিক্ত তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'প্রতিষ্ঠানের অতিরিক্ত তথ্য আপডেট করা যায় নি'
                ],
                'contactInfo' => [
                    'success' => 'প্রতিষ্ঠানের যোগাযোগের তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'প্রতিষ্ঠানের যোগাযোগের তথ্য আপডেট করা যায় নি'
                ],
                'globalInfo' => [
                    'success' => 'প্রতিষ্ঠানের গ্লোবাল তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'প্রতিষ্ঠানের গ্লোবাল তথ্য আপডেট করা যায় নি'
                ],
                'smsService' => [
                    'success' => 'প্রতিষ্ঠানের এসএমএস পরিষেবা সফলভাবে আপডেট করা হয়েছে।',
                    'error' => 'প্রতিষ্ঠানের এসএমএস পরিষেবা আপডেট করা যায়নি।'
                ]
            ]
        ],

        'user' => [
            'store' => [
                'success' => 'নতুন ইউজার সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন ইউজার তৈরি করা যায় নি'
            ],
            'update' => [
                'basic' => [
                    'success' => 'ইউজারের তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের তথ্য আপডেট করা যায় নি'
                ],
                'profile' => [
                    'success' => 'ইউজারের প্রোফাইল আপডেট করা হয়েছে',
                    'error' => 'ইউজারের প্রোফাইল আপডেট করা যায় নি'
                ],
                'updateDetails' => [
                    'success' => 'ইউজারের তথ্য সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের তথ্য আপডেট করা যায় নি'
                ],
                'updateEmail' => [
                    'success' => 'ইউজারের ইমেইল সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের ইমেইল আপডেট করা যায় নি'
                ],
                'updateRoles' => [
                    'success' => 'ইউজারের রোল সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'ইউজারের রোল আপডেট করা যায় নি'
                ],
                'updatePassword' => [
                    'success' => 'পাসওয়ার্ড সফলভাবে আপডেট করা হয়েছে',
                    'error' => 'পাসওয়ার্ড আপডেট করা যায় নি'
                ]
            ],
            'destroy' => [
                'success' => 'ইউজারকে সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'ইউজারকে মুছে ফেলা যায় নি'
            ],
            'changeStatus' => [
                'activate' => 'ইউজারকে সক্রিয় করা হয়েছে',
                'deactivate' => 'ইউজারকে নিষ্ক্রিয় করা হয়েছে'
            ]
        ],

        'role' => [
            'store' => [
                'success' => 'নতুন রোল সফলভাবে তৈরি করা হয়েছে',
                'error' => 'নতুন রোল তৈরি করা যায় নি'
            ],
            'update' => [
                'success' => 'রোল এবং পারমিশন সফলভাবে আপডেট করা হয়েছে',
                'error' => 'রোল এবং পারমিশন আপডেট করা যায় নি'
            ],
            'destroy' => [
                'basic' => [
                    'success' => 'রোল এবং পারমিশন সফলভাবে মুছে ফেলা হয়েছে',
                    'error' => 'রোল এবং পারমিশন মুছে ফেলা যায় নি',
                ],
                'removeUserFromRole' => [
                    'success' => 'রোল থেকে ইউজারকে সফলভাবে সরানো হয়েছে',
                    'error' => 'রোল থেকে ইউজারকে মুছে ফেলা যায় নি'
                ]
            ],
            'changeStatus' => [
                'activate' => 'রোলটি সক্রিয় করা হয়েছে',
                'deactivate' => 'রোলটি নিষ্ক্রিয় করা হয়েছে',
                'error' => 'সুপার এডমিন এর স্ট্যাটাস পরিবর্তন করা যাবে না'
            ]
        ],

        'brand' => [
            'store' => [
                'success' => 'নতুন ব্র্যান্ড সফলভাবে যোগ করা হয়েছে',
                'error' => 'নতুন ব্র্যান্ড যোগ করা যায় নি'
            ],
            'update' => [
                'success' => 'ব্র্যান্ড সফলভাবে আপডেট করা হয়েছে',
                'error' => 'ব্র্যান্ড আপডেট করা যায় নি'
            ],
            'destroy' => [
                'success' => 'ব্র্যান্ড সফলভাবে মুছে ফেলা হয়েছে',
                'error' => 'ব্র্যান্ড মুছে ফেলা যায় নি'
            ],
            'changeStatus' => [
                'activate' => 'ব্র্যান্ড সক্রিয় করা হয়েছে',
                'deactivate' => 'ব্র্যান্ড নিষ্ক্রিয় করা হয়েছে',
                'error' => 'ব্র্যান্ড এর স্ট্যাটাস পরিবর্তন করা যাবে না'
            ]
        ],
    ]
];
