<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Page Title
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom page title.
    |
    */

    'custom' => [
        'home' => 'হোম',
        'login' => 'লগইন',
        'configuration' => [
            'details' => 'সেটিংস',
            'basicInfo' => 'মৌলিক তথ্য',
            'additionalInfo' => 'অতিরিক্ত তথ্য',
            'contactInfo' => 'যোগাযোগের তথ্য',
            'globalInfo' => 'গ্লোবাল তথ্য',
            'smsService' => 'এসএমএস পরিষেবা'
        ],
        'user' => [
            'index' => 'ইউজারদের তালিকা',
            'create' => 'নতুন ইউজার',
            'show' => 'ইউজার ডিটেইলস',
            'edit' => 'এডিট ইউজার',
            'profile' => 'আমার প্রোফাইল'
        ],
        'role' => [
            'index' => 'রোলের তালিকা',
            'create' => 'নতুন রোল',
            'show' => 'রোল ডিটেইলস',
            'edit' => 'এডিট রোল'
        ],
        'permission' => [
            'index' => 'পারমিশনের তালিকা',
            'create' => 'নতুন পারমিশন',
            'edit' => 'এডিট পারমিশন'
        ],
        'brand' => [
            'index' => 'ব্র্যান্ডের তালিকা',
            'create' => 'নতুন ব্র্যান্ড',
            'edit' => 'এডিট ব্র্যান্ড'
        ],

    ]
];
